node {
  name: "Const"
  op: "Const"
  attr {
    key: "T"
    value {
      dtype: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 2
          }
          dim {
            size: 4
          }
        }
        tensor_content: "\000\000\200?\315\314\214?\315\314\014@33S@\315\314\214?\315\314\014@33S@\000\000\200@"
      }
    }
  }
}
node {
  name: "Const_1"
  op: "Const"
  attr {
    key: "T"
    value {
      dtype: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 2.0
      }
    }
  }
}
node {
  name: "Const:0"
  op: "Const"
  attr {
    key: "T"
    value {
      dtype: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "assign:0"
  op: "Assign"
  input: "v1"
  input: "Const:0"
  attr {
    key: "T"
    value {
      dtype: DT_FLOAT
    }
  }
}
node {
  name: "v1"
  op: "VariableV2"
  attr {
    key: "T"
    value {
      dtype: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
        shape {
        }
    }
  }
}
node {
  name: "Const_2"
  op: "Const"
  attr {
    key: "T"
    value {
      dtype: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000\003\000\000\000\004\000\000\000"
      }
    }
  }
}
node {
  name: "Const_3"
  op: "Const"
  attr {
    key: "T"
    value {
      dtype: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Hello World"
      }
    }
  }
}
node {
  name: "Placeholder:"
}
node {
  name: "Const_4"
  op: "Const"
  attr {
    key: "T"
    value {
      dtype: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 5
          }
        }
        string_val: "h"
        string_val: "e"
        string_val: "l"
        string_val: "l"
        string_val: "o"
      }
    }
  }
}
node {
  name: "mul_1:0"
  op: "Mul"
  input: "Const"
  input: "Const_1"
  attr {
    key: "T"
    value {
      dtype: DT_FLOAT
    }
  }
}
node {
  name: "add_2:0"
  op: "Add"
  input: "mul_1:0"
  input: "v1"
  attr {
    key: "T"
    value {
      dtype: DT_FLOAT
    }
  }
}
node {
  name: "Const_1:1"
  op: "Const"
  attr {
    key: "T"
    value {
      dtype: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        tensor_content: "\000\000\000\000"
      }
    }
  }
}
node {
  name: "sum_3:0"
  op: "Sum"
  input: "Const"
  input: "Const_1:1"
  attr {
    key: "T"
    value {
      dtype: DT_FLOAT
    }
  }
  attr {
    key: "keepdims"
    value {
      b: false
    }
  }
}
versions {
  producer: 26
}